In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'K2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1': np.random.randn(5),
                   'daaset2':np.random.randn(5)})
dframe

      K2   daaset2  dataset1 k1
0  alpha -0.202093 -0.402074  X
1   beta  0.545187 -2.078158  X
2  alpha  0.436523  0.410687  Y
3   beta -0.876595 -1.227345  Y
4  alpha -0.841820  0.070869  Z

In [4]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()

k1
X   -1.240116
Y   -0.408329
Z    0.070869
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY','LA','LA','NY','NY'])

months = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [10]:
dframe['dataset1'].groupby([cities, months]).mean()

LA  FEB   -2.078158
    JAN    0.410687
NY  FEB   -1.227345
    JAN   -0.165603
Name: dataset1, dtype: float64

In [11]:
dframe

      K2   daaset2  dataset1 k1
0  alpha -0.202093 -0.402074  X
1   beta  0.545187 -2.078158  X
2  alpha  0.436523  0.410687  Y
3   beta -0.876595 -1.227345  Y
4  alpha -0.841820  0.070869  Z

In [14]:
dframe.groupby('k1').mean()

     daaset2  dataset1
k1
X   0.171547 -1.240116
Y  -0.220036 -0.408329
Z  -0.841820  0.070869

In [16]:
dframe.groupby(['k1','K2']).mean()

           daaset2  dataset1
k1 K2
X  alpha -0.202093 -0.402074
   beta   0.545187 -2.078158
Y  alpha  0.436523  0.410687
   beta  -0.876595 -1.227345
Z  alpha -0.841820  0.070869

In [17]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [18]:
dframe

      K2   daaset2  dataset1 k1
0  alpha -0.202093 -0.402074  X
1   beta  0.545187 -2.078158  X
2  alpha  0.436523  0.410687  Y
3   beta -0.876595 -1.227345  Y
4  alpha -0.841820  0.070869  Z

In [19]:
for name,group in dframe.groupby('k1'):
    print("this is the %s group" %name)
    print(group)
    print('\n')

this is the X group
      K2   daaset2  dataset1 k1
0  alpha -0.202093 -0.402074  X
1   beta  0.545187 -2.078158  X


this is the Y group
      K2   daaset2  dataset1 k1
2  alpha  0.436523  0.410687  Y
3   beta -0.876595 -1.227345  Y


this is the Z group
      K2  daaset2  dataset1 k1
4  alpha -0.84182  0.070869  Z

In [21]:
for (k1,K2), group in dframe.groupby(['k1','K2']):
    print ("key1 = %s key2 = %s " %(k1, K2))
    print (group)
    print('\n')

key1 = X key2 = alpha
      K2   daaset2  dataset1 k1
0  alpha -0.202093 -0.402074  X


key1 = X key2 = beta
     K2   daaset2  dataset1 k1
1  beta  0.545187 -2.078158  X


key1 = Y key2 = alpha
      K2   daaset2  dataset1 k1
2  alpha  0.436523  0.410687  Y


key1 = Y key2 = beta
     K2   daaset2  dataset1 k1
3  beta -0.876595 -1.227345  Y


key1 = Z key2 = alpha
      K2  daaset2  dataset1 k1
4  alpha -0.84182  0.070869  Z

In [22]:
dframe

      K2   daaset2  dataset1 k1
0  alpha -0.202093 -0.402074  X
1   beta  0.545187 -2.078158  X
2  alpha  0.436523  0.410687  Y
3   beta -0.876595 -1.227345  Y
4  alpha -0.841820  0.070869  Z

In [23]:
group_dict = dict(list(dframe.groupby('k1')))

In [24]:
group_dict['X']

      K2   daaset2  dataset1 k1
0  alpha -0.202093 -0.402074  X
1   beta  0.545187 -2.078158  X

In [25]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [26]:
group_dict_axis1

{dtype('float64'):     daaset2  dataset1
 0 -0.202093 -0.402074
 1  0.545187 -2.078158
 2  0.436523  0.410687
 3 -0.876595 -1.227345
 4 -0.841820  0.070869, dtype('O'):       K2 k1
 0  alpha  X
 1   beta  X
 2  alpha  Y
 3   beta  Y
 4  alpha  Z}

In [28]:
dataset2_group = dframe.groupby(['k1','K2'])[['daaset2']]

In [30]:
dataset2_group

In [31]:
dataset2_group.mean()

           daaset2
k1 K2
X  alpha -0.202093
   beta   0.545187
Y  alpha  0.436523
   beta  -0.876595
Z  alpha -0.841820